package od;

public class Main18 {
    /**
     * <h1>斗地主之顺子</h1>
     * 扑克牌由小到大顺序为：<br>
     * 3，4，5，6，7，8，9，10，J,Q,K,A，2,<br>
     * 玩家扑克阵型有，单张，对子，顺子，飞机，炸弹<br>
     * 其中顺子规则：由至少5长由小到大连续递增的扑克牌组成，且不能包含2.<br>
     * 例如：<br>
     * 3 4 5 6 7、3 4 5 6 7 8 9 10 J Q K A都是有效顺子；<br>
     * J Q K A 2、2 3 4 5 6、3 4 5 6、3 4 5 6 8等都不是顺子<br>
     * 给定一个包含13张牌的数组，如果满足顺子，请输出顺子<br>
     * 如果存在多个顺子，请每行输出一个顺子，且需要按顺子的第一张牌大小依次输出。<br>
     * 如果没有满足出牌规则的顺子，输出NO<br>
     *
     * <h2>输入描述：</h2>
     * 13张任意顺序的牌，每张牌用空格隔开，每张牌数字是合法的，没有大小王：<br>
     * 2 9 J 2 3 4 K A 7 9 A 5 6<br>
     * 不用考虑输入为异常字符的情况<br>
     * <h2>输出描述：</h2>
     * 组成的顺子，每张牌用空格隔开<br>
     * 3 4 5 6 7<br>
     *
     * <h2>示例1：</h2>
     * <h3>输入：</h3>
     * 2 9 J 2 3 4 K A 7 9 A 5 6
     * <h3>输出：</h3>
     * 3 4 5 6 7
     */
    public static void main(String[] args) {

    }
}

