package od;

public class Main16 {
    /**
     * <h1>猜密码</h1>
     * 忘记了密码，只记得都是数字，而且数字都是不重复的，根据记住的数字范围和密码最小数量，计算可能的组合，规则如下：<br>
     * <li>输出的组合都是从可选的数字范围中选取的，且不能重复；</li>
     * <li>输出的密码数字要按照从小到大的顺序排列，密码组合需要按照字母顺序，从小到大的顺序排序</li>
     * <li>输出的没一个组合的数字的数量要大于等于密码最小数字数量；</li>
     * <li>如果可能的组合为空，则返回“None”</li>
     *
     * <h2>输入描述：</h2>
     * <li>输入的第一行是可能的密码数字列表，数字间以半角逗号分隔</li>
     * <li>输入的第二行是密码最小数字数量</li>
     * <h2>输出描述：</h2>
     * 可能的密码组合，每种组合显示 成一行，每个组合内部的数字以半角逗号分隔，从小到大的顺序排列。<br>
     * 输出的组合间需要按照字典序排序<br>
     * 比如：<br>
     * 2，3，4放到2，4的前面<br>
     * 备注：<br>
     * 字典序是指按照单词出现在字典的顺序进行排序的方法，比如：<br>
     * <li>a排在b前</li>
     * <li>a排在ab前</li>
     * <li>ab排在ac前</li>
     * <li>ac排在aca前</li>
     *
     * <h2>示例1：</h2>
     * <h3>输入</h3>
     * 2，3，4<br>
     * 2<br>
     * <h3>输出</h3>
     * 2，3<br>
     * 2，3，4<br>
     */
    public static void main(String[] args) {

    }
}

