package od;

public class Main11 {

    /**
     * <h1>解压报文</h1>
     * 为了提升数据传输的效率，会对传输的报文进行压缩处理，输入一个压缩后的报文，请返回它解压后的原始报文。
     * <h2>压缩规则：</h2>
     * n[str],表示方括号内部的str正好重复n次。<br>
     * 注意n为正整数（0 < n <= 100）,str只包含小写英文字母，不考虑异常情况。<br>
     *
     * <h2>输入描述：</h2>
     * 输入压缩后的报文
     * <li>不考虑无效输入，报文没有额外的空格，方括号总是符合格式要求的</li>
     * <li>原始报文不包含数字，所有的数字只表示重复的次数n,例如不会出现像5b或3[8]的输入</li>
     *
     * <h2>输出描述：</h2>
     * 解压后的原始报文
     * 注：原始报文长度不会超过1000，不考虑异常的情况
     *
     * <h2>示例1：</h2>
     * <h3>输入：</h3>
     * 3[k]2[mn]
     * <h3>输出</h3>
     * kkkmnmn
     */
    public static void main(String[] args) {


    }
}

