package od;

public class Main13 {

    /**
     * <h1>火锅</h1>
     * 入职后导师会请你吃饭，你选择火锅。<br>
     * 不同食材煮不同的时间，你希望吃到最多刚好合适的菜，<br>
     * 用m代表手速，每次下手捞菜至少要过m秒才能再捞（每次只能捞一个）<br>
     *
     * <h2>输入描述：</h2>
     * 第一行两个正整数n,m其中n代表往锅里下的菜个数，m代表手速。<br>
     * 接下来n行，每行有两个数x,y代表第x秒下的菜过y秒才能刚好合适。<br>
     * 1 < n,m < 1000<br>
     * 1 < x,y < 1000<br>
     *
     * <h2>输出描述：</h2>
     * 输出一个整数代表最合理的策略，最多能吃到刚好合适的菜的数量
     *
     * <h2>示例1：</h2>
     * <h3>输入：</h3>
     * 2 1<br>
     * 1 2<br>
     * 2 1<br>
     *
     * <h3>输出</h3>
     * 1
     */
    public static void main(String[] args) {

    }
}

